#### Series in Pandas

In [53]:
import pandas as pd
import numpy as np

In [54]:
lable=['a','b','c','d']
my_data=[10,20,30,40]
arr=np.array(my_data)

In [55]:
pd.Series(data= my_data, index=lable)

a    10
b    20
c    30
d    40
dtype: int64

In [56]:
pd.Series(arr, lable)

a    10
b    20
c    30
d    40
dtype: int64

In [57]:
ser1= pd.Series([1,2,3,4],['USA','India','UK','Italy'])

In [58]:
ser1

USA      1
India    2
UK       3
Italy    4
dtype: int64

In [59]:
arr=np.array(ser1)

In [60]:
ser1

USA      1
India    2
UK       3
Italy    4
dtype: int64

In [61]:
ser2= pd.Series([5,6,7,8],['London','France','Norway','Canada'])

In [62]:
ser2

London    5
France    6
Norway    7
Canada    8
dtype: int64

In [63]:
ser2['London']

5

In [64]:
ser3=ser1+ser2

In [65]:
ser3

Canada   NaN
France   NaN
India    NaN
Italy    NaN
London   NaN
Norway   NaN
UK       NaN
USA      NaN
dtype: float64

##  Pandas--DataFrames

In [66]:
from numpy.random import randn

In [67]:
np.random.seed(101)

In [68]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [69]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [70]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [71]:
type(df['w'])

pandas.core.series.Series

In [72]:
df.w

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [74]:
df['new'] = df['w']+ df['y']

In [75]:
df['new']

a    3.614819
b   -0.196959
c   -1.489355
d   -0.744542
e    2.796762
Name: new, dtype: float64

In [76]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

In [81]:
df.drop('new', axis=1, inplace=True)

In [82]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [86]:
df.drop('e' , axis=0, inplace=True)

In [87]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [88]:
df.shape

(4, 4)

In [89]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [92]:
df.describe()

              w         x         y         z
count  4.000000  4.000000  4.000000  4.000000
mean   0.382124  0.072516 -0.086133  0.368962
std    1.938687  0.730102  0.942434  0.667223
min   -2.018168 -0.758872 -0.933237 -0.589001
25%   -0.363021 -0.429207 -0.869367  0.230619
50%    0.419907  0.154407 -0.159632  0.554896
75%    1.165051  0.656130  0.623602  0.693238
max    2.706850  0.740122  0.907969  0.955057

In [93]:
df.loc['a']  #first way to show row

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [94]:
df.iloc[2] # 2nd way to show row

w   -2.018168
x    0.740122
y    0.528813
z   -0.589001
Name: c, dtype: float64

In [96]:
df.loc['a','y']

0.9079694464765431

In [97]:
df.loc[['a','b'],['y','w']]

          y         w
a  0.907969  2.706850
b -0.848077  0.651118

In [98]:
df>0

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True

In [99]:
df<0

       w      x      y      z
a  False  False  False  False
b  False   True   True  False
c   True  False  False   True
d  False   True   True  False

In [100]:
booldf= df>0

In [101]:
booldf

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True

In [102]:
df[booldf]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057